Simulations/MEXICO/2019/11-May20/Group3/3-V7/constant/sourcesPropertiesNO
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      sourcesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

disk1
{
    type            actuationDiskSource;
    active          off;            //on/off switch
    timeStart       0.0;           //start time
    duration        1000.0;        //duration
    selectionMode   cellSet;       //cellSet // points //cellZone
    cellSet         actuationDisk1;//cellSet name when selectionMode = cellSet

    actuationDiskSourceCoeffs
    {
        fieldNames  (U);
        diskDir     (-1 0 0); // orientation of the disk
        Cp          0.386;     // Cp
        Ct          0.58;     // Ct
        diskArea    40;       // disk area
        upstreamPoint (581849 4785810 1065);
    }
}

disk2
{
    type            actuationDiskSource;
    active          off;
    timeStart       0.0;
    duration        1000.0;
    selectionMode   cellSet;
    cellSet         actuationDisk2;

    actuationDiskSourceCoeffs
    {
        fieldNames  (U);
        diskDir     (-1 0 0);
        Cp          0.386;
        Ct          0.58;
        diskArea    40;
        upstreamPoint (581753 4785663 1070);
    }
}

// ************************************************************************* //
